# Gmail เเสนยุ่งยาก

พี่เคยคิดว่าถ้าการสร้าง Gmail มีกฏที่ต้องสร้างชื่อตามคงเเปลกน่าดู งั้นมาลองดูกัน
กฏที่ต้องทำเรียงตามเเต่ละข้อไปมีอยู่ว่า

1.ถ้าชื่อที่ใช้ยาวมากกว่า 5 ตัวต้องใส่ความยาวชื่อไว้ด้านหลังด้วย (Input ยาวไม่ถึง 60 เเละมีเเต่ตัวอักษรอังกฤษ)

2.ถ้าชื่อที่ใช้ยาวน้อยกว่าหรือเท่ากับ 5 ตัวต้องใส่ 'X' ไว้หน้าสุดของชื่อ

3.ถ้าชื่อที่ใช้มีสระให้เปลี่ยนสระเป็นตัวอักษรถัดไปใน alphabet เช่น e->f คงพิมพ์เล็กพิมพ์ใหญ่ไว้

4.ต้องต่อท้ายด้วย @CEmail.com เสมอ

## Solution

```c
// Your code here
```