# หาเลขให้อ้าย

เขียนโปรแกรม รับค่าตัวเลข แล้วแสดงตำแหน่ง row, column ดังตัวอย่าง

ถ้า ตัวเลขที่ป้อนเข้ามาไม่มีใน ให้แสดง NOT FOUND!

EX:
 *** Find a value in array 2 dimension ***
Enter a value :     2    3    5    7   11   13   17   19   29   31
   37   41   43   37   61   71   73   79   83   97
  103  107  109  113  131  151  181  191  193  173
  163  113  102  107  127  137  257  139  149  369
  212  224  236  248  313  326  339  341  355  368
    2    4    6    6   10   12   14   16   18   20
    1    3    5    7    9   11   13   17   19   21
  163  113  102  107  127  137  257  139  149  369

Finding value => 2
1. (row,column) => (1,1)
2. (row,column) => (6,1)


## Solution

```c
// Your code here
```