# PrimeCount

จำนวนเฉพาะ คือจำนวนที่มีแค่ 1 กับตัวมันเองเท่านั้นหารลงตัว เช่น 2,3,5,7,11,13,..... จำนวนเฉพาะมีได้เป็นอนันต์ก็คือมีได้เรื่อยๆนั่นเอง แต่พี่เกิดสงสัยว่า เอ๊ะ จำนวนเฉพาะที่มันไม่เกิน 100 เนี่ยมันมีกี่ตัวกัน พี่ก็เลยนั่งนับเพราะพี่ว่าง สรุปคือพี่นับได้ 25 ตัว (2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97) แต่พี่ไม่เก่งเลยกว่าจะนับได้พี่ก็ใช้เวลาไปครึ่งปี!?? แต่ความอยากรูอยากเห็นพี่น่ะนะ มันมากกว่าจำนวนเฉพาะอีก แต่พี่นับเองไม่ไหวแล้ว น้องๆช่วยพี่นับหน่อยว่าจำนวนเฉพาะที่ไม่เกิน N มีทั้งหมดที่ตัว

## Solution

```c
// Your code here
```