# ล้อมรอบกองไฟ ห้ามใช้ loop, if-else, string.h

ถ้าเรามีฉลากเป็นเลข 1 ถึง 120 โดยจะอยู่ในกลุ่มตามเลขฉลากที่จับได้ดังนี้ 

Paladin 1-10

Rogue 11-20

Sorcerer 21-30

Bard 31-40

Priest 41-50

Monk 51-60

Ranger 61-70

Fighter 71-80

Barbarian 81-90

Wizard 91-100

Warlock 101-110

Samurai 111-120

คนที่อยู่ในกลุ่มเดียวจะอยู่ด้วยกันเเละทั้ง 12 กลุ่มจะต้องล้อมรอบกองไฟเรียงเป็นวงกลมเรียงตามเข็มนาฬิกาตามลำดับด้านบน

ถ้าคนที่จับฉลากได้เลขตามอินพุตหันหน้าหรือหันหลังให้กองไฟจะมีกลุ่มอะไรอยู่ทางซ้ายมือ ขวามือ เเละตรงข้ามกับที่เขามองอยู่(ถ้าหันหลังให้กองไฟจะไม่มีกลุ่มที่อยู่ตรงข้าม)

input: 

บรรทัดเเรก เลขฉลากตั้งเเต่ 1-120

บรรทัดสอง หันหน้าหรือหันหลังให้กองไฟ (Front/Back)

output: 

บรรทัดเเรก Left:กลุ่มที่อยู่ทางซ้ายมือ

บรรทัดสอง Right:กลุ่มที่อยู่ทางขวามือ

บรรทัดสาม Opposite:กลุ่มที่เห็นอยู่ฝั่งตรงข้าม (String ว่างถ้า input เป็น Back)

## Solution

```c
// Your code here
```