# เขียน Braille (สนุกเเหละมั้ง) [ไม่น่า]

มาเขียนภาษาเบลล์เเบบง่าย(มั้ง)กัน ของจริงมีกฎเยอะกว่านี้เเต่เอากฎเเค่นี้ก่อนเเล้วกัน

1. อักษรมี 2 ประเภทคือ ตัวเลข กับ ตัวอื่นที่ไม่ใช่ตัวเลข
2. '.' จะถือเป็นตัวเลขก็ต่อเมื่อตามหลังด้วยเลข
3. ถ้าตัวเลขตามหลังตัวอื่นที่ไม่ใช่ตัวเลข จะต้องใส่ตัว number ไว้ก่อนหน้าตัวนั้น
4. ถ้าตัวอื่นที่ไม่ใช่ตัวเลขตามหลังตัวเลข จะต้องใส่ตัว letter ไว้ก่อนหน้าตัวนั้น
5. ข้อยกเว้นคือ ตัว space '.' '-' ',' '?' '!' ''' ตามหลังตัวเลขได้เลย
6. ตัวอักษรภาษาอังกฤษพิมพ์ใหญ่จะต้องใส่ตัว capital ไว้ก่อนหน้าเสมอ (ถ้าตามหลังตัวเลขใช้ capital เเทน letter ไปเลย)
7. ทุกบรรทัดจะเริ่มโดยคิดว่าเป็นตัวอื่นที่ไม่ใช่ตัวเลขเสมอ (ถ้าเริ่มด้วยตัวเลขต้องใส่ตัว number ไว้ก่อน)

ตัวอักษรดูตามภาพด้านล่างได้เลย พี่จะให้ใช้เเค่ตัวอักษรภาษาอังกฤษ ตัวเลข space letter capital number '.' '-' ',' '?' '!' ''' ก็พอ

![Braille](https://ih1.redbubble.net/image.864549389.4330/bg,f8f8f8-flat,750x,075,f-pad,750x1000,f8f8f8.u3.jpg)

input:

บรรทัดเเรก จำนวนบรรทัดที่เหลือ

บรรทัดที่เหลือ ประโยคหรือคำที่จะให้เเปลง (ตั้งยาวเป็น 1000 เลยก็ได้)

output: ภาษาเบลล์ที่เเปลงมาเเล้ว X เเทนจุดดำ O เเทนจุดขาว เเต่ละตัวเว้นด้วย ' ' เเละเว้นว่างระหว่างเเต่บรรทัดของ input

Ex: 

input:

2

CE Boostup

up and down

output:

OO XX OO XO OO OO XO XO XO OX OX XO XX 

OO OO OO OX OO OO XO OX OX XO XX OO XO 

OX OO OX OO OO OX OO XO XO XO XO XX XO 

(นี่เว้นว่างนะเเละขอโทษกับการที่ตัวอักษรเเต่ละบรรทัดมันไม่ตรงกัน ฉานพยายามเเล้ว ( '﹃' ))

XO XX OO XO XX XX OO XX XO OX XX 

OO XO OO OO OX OX OO OX OX XX OX 

XX XO OO OO XO OO OO OO XO OX XO 
 

## Solution

```c
// Your code here
```