# fibonacci อะไรไม่ใช้ loop

น้องๆน่าจะรู้จักลำดับ fibonacci กันแหละ พี่เชื่อว่าถ้าน้องเขียนโค้ด(แบบปกติอะนะ) ก็น่าจะเขียนได้แหละ เพราะงั้นพี่เลยอยากให้น้องเขียนแบบไม่ปกติดู ปกติน้องใช้ loop ใช่มั้ย พี่ไม่ให้ใช้ว้าฮ่าๆๆๆ ให้น้องเขียนโปรแกรมรับค่า Input เป็น int (จำนวนเต็มบวก) แล้วแสดงผลลำดับ fibonacci โดนเริ่มจาก 0 เช่น                                                            
                                                     
Input 8                                             
Output 0 1 1 2 3 5 8 13                                    
                                                                                           
Input 1                                             
Output 0                                     
                                                     
Input มีค่าไม่เกิน 40                                                
GLHF!!!! ขอให้สนุกนะน้องๆ

## Solution

```c
// Your code here
```