# เขาวงกตแสนสนุก

พี่มีเกมเขาวงกตแสนสนุกมาให้น้องๆ ลองทำโดย

-บรรทัดแรกรับ input เป็นตัวเลข 1 ตัวเพื่อสร้างเขาวงกตขนาด n*n

-บรรทัดต่อมาจนถึงบรรทัดที่ n ให้สร้างเขาวงกตไม่เกินขนาดที่น้องรับ input มา

โดย S (พิมพ์ใหญ่) เป็นจุดเริ่มต้นและ G เป็นจุดสิ้นสุดมี # เป็นกำแพงและให้เดินผ่านทาง . เท่านั้นเดินผ่านกำแพงไม่ได้โดยถ้าสามารถหาเส้นทางจาก S ไป G ได้ให้ print "Path Found" ถ้าหาเส้นทางไม่ได้ให้ print "Path Not Found" ออกมาคับ



ปล.1 ขนาดเขาวงกตไม่เกิน 50*50 พอคับ (ไม่ต้องใหญ่เดะพี่หลง)

ปล.2 เดินแบบ บน ล่าง ซ้าย ขวา เท่านั้นไม่มีเดินทแยงนะครับ

ปล.สุดท้าย หลงทางได้แต่อย่าหลงเธอก็พอคับ สู้ๆๆ 😉😉😉

ใบ้ๆ หลักการ DFS สำคัญในข้อนี้คับ/ใช้ array 2 มิติ 2 อัน คือตัวเขาวงกตเป็น string กับ ตัวเช็คว่าเคยเดินแล้วเป็น int

## Solution

```c
// Your code here
```