/*
    ::::::::  ::::::::::  ::::::::        :::    ::: ::::    ::::  ::::::::::: ::::::::::: :::
   :+:    :+: :+:        :+:    :+:       :+:   :+:  +:+:+: :+:+:+     :+:         :+:     :+:
   +:+        +:+        +:+              +:+  +:+   +:+ +:+:+ +:+     +:+         +:+     +:+
   +#+        +#++:++#   +#+              +#++:++    +#+  +:+  +#+     +#+         +#+     +#+
   +#+        +#+        +#+              +#+  +#+   +#+       +#+     +#+         +#+     +#+
   #+#    #+# #+#        #+#    #+#       #+#   #+#  #+#       #+#     #+#         #+#     #+#
    ########  ##########  ########        ###    ### ###       ### ###########     ###     ##########
 */

#include <stdio.h>

int main(void)
{
    int n, hn;
    scanf("%d", &n);
    hn = (n / 2) + 1;
    if (!(n % 2))
    {
        printf("Error: Input must be an odd number.");
        return 0;
    }
    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j < n; j++)
        {
            //  ขาาาาาาาาาาาาาาาาาาาาาาา     ครึ่งซ้ายยยยยยยยยยยยยยยยยยยยยยย      ครึ่งขวาาาาาาาาาาาาาาาาาาาาาาาาาาาาาาาาา
            if ((!j || j == n - 1) || ((i == j) && (i < hn && j < hn)) || ((j == n - i - 1) && (j >= hn))) printf("*");
            else printf(" ");
        }
        printf("\n");
    }
    return 0;
}