# 64thFoundation

ฉันอยากส่งข้อความไปยังอาณาจักรทางเหนือ เนื่องด้วยสถานการณ์ในประเทศเราไม่ดีเท่าไร เพียงแต่การใช้รหัสมอสเหมือนที่ผ่านๆ มานั้นถูกทุกประเทศในทวีปถอดรหัสออกหมดแล้ว เพราะมีคนทำโปรแกรมแปลงรหัสมอสออกมา ดังนั้น เราจึงอยากเปลี่ยนรูปแบบการเข้ารหัส
โดยรูปแบบใหม่นี้จะเปลี่ยนข้อมูลต้นฉบับให้เป็นตัวอักษรที่อยู่ในตาราง ASCII เท่านั้น โดยจะแปลงข้อมูลทุก 3 ไบต์ให้กลายเป็น 4 ตัวอักษรจากชุดสัญลักษณ์ที่กำหนดไว้ล่วงหน้า 64 ตัว วิธีนี้ช่วยให้ข้อความสามารถส่งผ่านช่องทางที่รองรับเฉพาะข้อความได้อย่างปลอดภัยยิ่งขึ้น

## Solution

```c
// Your code here
```