# Instant Runoff

ในอาณาจักรแห่งหนึ่งมีการเลือกตั้งเกิดขึ้น โดยในอาณาจักรมีการเลือกตั้งแบบ Instant Runoff
จึงขอให้เขียนโปรแกรมเช็คผลการเลือกตั้งแบบ Instant Runoff ให้หน่อย

## 🗳️ Instant Runoff คือ
> Instant Runoff เป็นการเลือกตั้งโดยที่
ผู้มีสิทธิเลือกตั้งสามารถลงคะแนนเลือกผู้สมัครได้หลายคนตามลำดับความชอบ โดยนับคะแนน จากลำดับแรกก่อน หากมีผู้สมัครที่ได้คะแนนเสียงข้างมาก (มากกว่า 50%) ผู้สมัครคนนั้นจะชนะการเลือกตั้งทันที
แต่หากยังไม่มีผู้สมัครที่ได้รับเสียงข้างมาก ผู้สมัครที่ได้คะแนนน้อยที่สุดจะตกรอบ โดยคะแนนเสียงของผู้ที่ตกรอบ ก็จะตกให้กับผู้สมัครในลำดับถัดไป โดยจะทำต่อไปจนกว่าจะได้ผู้สมัครที่ได้คะแนนเสียงข้างมาก

**หมายเหตุ**:
- ในกรณีที่ผู้สมัครได้คะแนนน้อยสุดเท่ากันหลายคน ผู้สมัครทั้งหมดจะตกรอบนั้นทันที ยกเว้นว่าถ้าผู้สมัครทุกคนได้เท่ากันหมด ให้ถือว่าเป็นเสมอ
- หากมีการออกเสียงให้กับผู้ที่ไม่ได้สมัคร (เช่นมีผู้สมัคร 3 คนแต่เลือกให้คนที่ 4) ถือว่าบัตรเสีย
- ถ้ากาเลขซ้ำ ถือว่าบัตรเสีย
- ถ้าบัตรเสีย ไม่ต้องนับคะแนนใบนั้น

## 🗨️ คำอธิบาย Input-Output
| คำอธิบาย | Input |
| ------------- | ------------- |
| บรรทัดแรกรับ `int` สองจำนวน เป็นจำนวนผู้สมัคร (n) และจำนวนผู้ที่มาใช้เสียง (m) | `3 5` |
| บรรทัดถัดไป รับชื่อของผู้สมัครทั้งหมด เป็น `str` (ผู้สมัครจะเรียงเป็นลำดับ 1 ถึง n) | `Alice Bob Carol` |
| m บรรทัดที่เหลือ เป็นการเลือกตั้งของผู้มาใช้เสียง รับเป็น `int` ทั้งหมด n จำนวนต่อคนที่ใช้เสียง (เรียงลำดับความชอบตามเลขที่มาก่อน) | `1 2 3` `2 1 3` `3 2 1` `2 1 3` `1 3 2` |

_ดู Output ได้ใน Test case_
### รูปภาพประกอบ
![Instant Runoff Voting](https://external-content.duckduckgo.com/iu/?u=http%3A%2F%2Fdrive.google.com/uc?id=1QvZJlx2Ip5SVihi0BejLco6TMmVN9rkM)

## Solution

```c
// Your code here
```