# พื้นฐานนักสืบ : 003 | บทส่งท้าย

## พื้นฐานนักสืบ : 003 | บทส่งท้าย

> ### ความเดิมจากตอนที่แล้ว
เราได้ไขรหัสเพื่อเปิดเซฟในห้องลับของบ้านพักตากอากาศแล้ว โดยได้รหัสที่มีคำว่า Confes ที่หมายถึงคำสารภาพ เมื่อเปิดตู้ได้เรากับพบเพียงเอกสารจำนวนมากที่เก็บไว้ ซึ่งทั้งหมดนี้กับมีลอยบางอย่างอยู่ คุณได้ทำการแสกนเอกสารทั้งหมดก่อนส่งให้เจ้าของบ้าน และต้องการหาว่าในนั้นมีอะไรกันแน่ ส่วนเรื่องงานหาห้องลับนั้นก็ได้จบเพียงเท่านั้น เอกสารจำนวนมากที่คุณได้แสกนมามีรูปแบบเป้นข้อความในช่อง `10*10` และมีส่วนแปลกๆเป็นตัวอักษรแค่บางตัว ด้วยจำนวนเอกสารที่มากดังนั้นแล้ว ช่วยเขียนโค้ดวงล้อมรอบจุดที่หน้าสงสัยให้หน่อยนะ โดยที่ `' '` เป็นช่องว่าง และตัวอักษรอื่นๆ เป็น สิ่งของที่ต้องวงล้อมรอบ

> ### หมายเหตุ
1. Input | เป็น text รับทีละบรรทัด บรรทัดละ 10 อักษรจำนวน 10 บรรทัด
2. Output | เป็น Array ขนาด `12*12` 
    1. มีกรอบเป็นตัวเลข 0-9 (ด้านซ้าย และ ด้านบน) 
    2. มีมุมบนซ้ายเป็น '/' 
    3. ส่วนด้านที่เหลือเป็น '*' 
    4. ข้างในเป็น input ที่วงรอบตัวอักษร

![รูปประกอบ](https://i.ibb.co/dw0vpDzF/003.png)

## Solution

```c
// Your code here
```