# ModeSort

คุณได้รับมอบหมายให้เขียนโปรแกรมที่ช่วยแยกและจัดเรียงตัวเลขตามเงื่อนไขพิเศษ โดยมีโหมดต่าง ๆ ที่กำหนดรูปแบบการจัดลำดับของเลขคู่และเลขคี่แตกต่างกัน
| Mode | การจัดเรียงเลขคู่  | การจัดเรียงเลขคี่  |
| ---- | ------------------ | ------------------ |
| 0    | เลขคู่จากน้อยไปมาก | เลขคี่จากมากไปน้อย |
| 1    | เลขคู่จากมากไปน้อย | เลขคี่จากน้อยไปมาก |
| 2    | เลขคู่จากมากไปน้อย | เลขคี่จากน้อยไปมาก |
| 3    | เลขคู่จากน้อยไปมาก | เลขคี่จากมากไปน้อย |

## Input:
บรรทัดแรก: จำนวนเต็ม n แสดงจำนวนของตัวเลข
บรรทัดถัดมา: รับตัวเลขจำนวน n จำนวน โดยแต่ละตัวเป็นจำนวนเต็ม
บรรทัดสุดท้าย: จำนวนเต็มmodeซึ่งมีค่าตั้งแต่ 0 ถึง 3
`ตัวสุดท้ายของoutput "num" นอกนั้น "num "`

## Solution

```c
// Your code here
```