# FamousPochana

พี่เฟมได้ไปเสาะหาร้านอาหารร้านลับป้าฉลู หลังจากไปทานพี่เฟมติดใจมากๆๆๆ เลยมาเปิดร้านอาหารชื่อว่า Famousโภชนา โดยทำอาหารตามออร์เดอร์ที่ลูกน้องจดมา แต่ลูกน้องเป็นคนฝรั่งพูดไทยไม่ได้เลยจดมาเป็นตัวอักษร ABC แทน และจดจำนวนที่สั่งติดๆกัน เช่น A2B5C10A4 แปลว่า สั่ง A=6จาน B=5จาน C=10จาน แต่พี่เฟมเป็นคนอีโก้สูง พี่เฟมจะทำแค่เมนูเดียวคือเมนูที่มีคนสั่งมากที่สุด แล้วทำทุกจานเป็นเมนูนั้นเลย อย่างที่สั่งไว้ก็จะได้ จาน C หมดเลย 21 จาน น้องๆช่วยพี่เฟมรับออเดอร์ แล้วสรุปให้หน่อยว่าพี่เฟมจะต้องทำเมนูอะไร และ กี่จาน(ถ้าจำนวนเท่ากันเอาจานแรกที่ไล่จาก A-Z)

## Solution

```c
// Your code here
```