# รหัสลับแห่งลำดับอักษร

## รหัสลับแห่งลำดับอักษร
___

ณ สถาบันวิจัยเทคโนอาร์ค หน่วยงานลับด้านปัญญาประดิษฐ์ — น้องเป็นนักศึกษาฝึกงานถูกเรียกตัวไปยังห้องควบคุมกลางโดยไม่ทราบสาเหตุ
บนหน้าจอปรากฏข้อความจากนักวิจัยปริศนาซึ่งหายตัวไปเมื่อ 5 ปีก่อน เขาทิ้งไว้เพียงบันทึกดิจิทัลพร้อมรหัสข้อความแปลกๆ ว่า: aaabbccccdeeeff 
ข้างใต้เขียนว่า: "หากเจ้าจะถอดรหัสนี้ จงใช้เพียงตัวแรก แล้วบอกจำนวนสิ่งที่เหมือนติดกัน — รหัสนี้คือกุญแจสู่ห้องวิจัยชั้นใน"
พี่อยากให้น้องช่วยถอดรหัสลับเพื่อพาพี่เข้าไปดูภายในห้องวิจัยหน่อย

`***input เป็น string ความยาวไม่เกิน 100 ตัวอักษร***`


## Solution

```c
// Your code here
```