# พอจะบอกเวลาให้หน่อยได้มั้ย 3

## พอจะบอกเวลาให้หน่อยได้มั้ย 3

![logo](https://i.ibb.co/hF3T3Tbc/all-logo.png)

> น้องเคยเป็นมั้ย กำลังเล่นเกมหรือทำอะไรสักอย่างอยู่แต่ลืมว่าทำไปนานขนาดไหนแล้ว อยากให้น้องช่วยคิดเวลาให้พี่เป็นหน่วยตามที่กำหนดให้หน่อย จะได้รู้ว่าเวลาผ่านไปนานขนาดไหนแล้ว เอาวิธีง่ายๆเลยแล้วกัน ช่วยให้หน่อยนะ เหมือนว่าพี่จะเอาเวลาไปทิ้งเยอะมาก !

+ เวลาไม่ติดลบนะ และให้หน่วยมีแค่ s m และ h
+ ระวังหน่วย ถ้าอะไรผิดก็ `Error` แบบขึ้นบรรทัดใหม่ได้เลย

## Solution

```c
// Your code here
```