# upper ,lower

ในการจัดการข้อมูลบางทีตัวคำที่ได้รับมานั้นก็ไม่ตรงกับข้อมูลจริง เช่น ตัวอักษรพิมพ์ใหญ่-เล็ก แต่ละภาษาก็จะมีคำสั่งที่สามารถเปลี่ยนคำทั้งคำเป็นตัวพิมพ์เล็กหรือพิมพ์ใหญ่ทั้งหมดได้ แต่ว่าที่นี้คือ ce.boostup พี่อยากให้น้องเขียน toupper tolower เองโดยพี่จะให้ตัวอักษรตัวพิมพ์เล้หรือตัวพิมพ์ใหญ่แล้วให้น้องแปลงเป็นแบบตรงข้ามเช่น input เป็นตัวพิมพ์ใหญ่แสดงผลตัวพิมพ์เล็ก หรือ input เป็นตัวพิมพ์เล็กแสดงผลตัวพิมพ์ใหญ่ แต่ถ้า input ไม่ใช่ตัวอักษรไม่ต้องแสดงผล

# Input 
##### บรรทัดที่ 1 ค่า char

# Output
##### บรรทัดที่ 1 ตัวอักษรที่ถูกแปลงแล้ว 

[ตัวช่วย](https://www.ascii-code.com/)

## Solution

```c
// Your code here
```