# สี่เหลี่ยมเรื่องมาก

ให้น้องสร้างสี่เหลี่ยมทึบโดยรับ input เป็นเลข 2 ตัวขั้นด้วย space bar เป็นขนาดของความกว้างและความยาวของสี่เหลี่ยม

ปล.1 ตัวเลขแรกคือด้านกว้าง (แนวนอน) ตัวเลขที่สองคือด้านยาว (แนวตั้ง)

ปล.2 เช็คประเภท input ดีๆนะคับ 🤭🤭🤭

ปล.3 ถ้า input ความกว้างหรือความยาวน้อยกว่าหรือเท่ากับ 0 ให้ขึ้น width or length must more than 0 นะคับ ส่วนกรณีของเป็นตัวอักษรให้ขึ้น wrong type คับ

ปล.4 กรณีที่ input เป็น ตัวอักษรและเลขน้อยกว่าเท่ากับ 0 ให้ขึ้น wrong type เป็นหลักนะคับ

## Solution

```c
// Your code here
```