# หมาป่าเดียวดาย

คำอธิบาย พี่เฝ่ามองแสงจันทร์แล้วก็เกิดความสงสัยว่า code ของพระจันทร์จะหน้าตาเป็นยังไงแล้วที่นี้พี่ก็เปิดเลยแล้วเห็นว่า Moon Phase มีตั้ง 8 phase แหละทำให้พี่คิดว่าถ้าให้น้องๆทำ moon phase มันคงสนุกแน่ๆเลยโดยโจทย์ของพี่น้องๆวางใจได้เลยเพราะพี่ออกมาแต่โจทย์วงกลมไม่เหลี่ยมน้องแน่นอน แล้วโจทย์นี้น้องไม่ต้องกัน error อะไรทั้งนั้นให้คิดว่า พี่เช็ค input เป็นทุกๆ moon phase ก็พอ 🌑 🌒 🌓 🌔 🌕 🌖 🌗 🌘 หมายเหตุ input แรกจะเป็นรัศมีของพระจันทร์ ส่วน input ที่ 2 จะเป็น phase ของพระจันทร์โดยจะมีเพียง 1-8 phase condition นอกเหนือจากนี้ให้ output error

[watching moon phase](https://www.timeanddate.com/astronomy/moon/phases.html)

## Solution

```c
// Your code here
```