# ft_print

ในโลกของระบบปฏิบัติการที่ทุกอย่างต้องสื่อสารกันผ่าน system call หน่วยงานหนึ่งได้ออกแบบโปรแกรมที่ทำหน้าที่ "แปลง" ข้อความธรรมดาให้กลายเป็นคำสั่ง write() สำหรับระบบปฏิบัติการ UNIX
ภารกิจของคุณคือช่วยนักพัฒนาแปลงข้อความที่ผู้ใช้กรอกเข้ามา ให้ออกมาในรูปแบบของคำสั่ง write() โดยจะต้องนับจำนวนตัวอักษรที่แท้จริงอย่างถูกต้องด้วย

## แต่
มีสิ่งหนึ่งที่คุณต้องระวัง... ถ้าผู้ใช้ป้อนข้อความที่มี \n (สองตัวอักษร: backslash และ n) อยู่ในนั้น มันเป็นเพียง escape sequence ที่จะแสดงเป็นการขึ้นบรรทัดใหม่ ซึ่งในการนับจำนวนอักขระจริงต้อง "ละ" escape sequence นั้นไป 1 ตัวอักษร (นับ \n แค่เป็นตัวเดียว ไม่ใช่สองตัว)


## Solution

```c
// Your code here
```