# กระดานหมากรุกเรื่องมาก

พี่อยากให้น้องสร้างตารางหมากรุกให้พี่หน่อยโดยกำหนด input เป็นตัวเลข 2 ตัวคือด้านกว้างและด้านยาวของกระดาน โดยช่องดำแทนที่ด้วยดอกจัน "*" และช่องขาวแทนที่ด้วย space bar " " 

ปล.1 ตัวเลขแรกคือด้านกว้าง (แนวนอน) ตัวเลขที่สองคือด้านยาว (แนวตั้ง)

ปล.2 เช็คประเภท input ดีๆนะคับ 🤭🤭🤭

ปล.3 ถ้า input ความกว้างหรือความยาวน้อยกว่าหรือเท่ากับ 0 ให้ขึ้น width or length must more than 0 นะคับ ส่วนกรณีของเป็นตัวอักษรให้ขึ้น wrong type คับ

ปล.4 กรณีที่ input เป็น ตัวอักษรและเลขน้อยกว่าเท่ากับ 0 ให้ขึ้น wrong type เป็นหลักนะคับ

ปล.5 กระดานหมากรุกต้องขึ้นด้วยช่องดำ "*" เสมอนะ

## Solution

```c
// Your code here
```