# RingLock

ณ สถานีอวกาศร้างกลางกาแล็กซี มีตู้เซฟโบราณที่เรียกว่า “Ringlock” ซึ่งเก็บ คีย์แห่งการปลุกพลังจักรวาล ไว้ แต่กลไกเปิดของมันไม่ใช่รหัสผ่านธรรมดา — มันคือ กลไกวงแหวนรหัสซ้อนกันหลายชั้น
วงแหวนแต่ละชั้นมีอักขระโบราณเรียงอยู่เป็นวงกลม
ทุกวงแหวนหมุนซ้ายได้ทีละ 1 คลิก (เหมือนหมุนกลอน)
ทุกคลิกจะหมุนวงแหวนทุกชั้นพร้อมกัน 1 ตำแหน่ง
เป้าหมายคือ หมุนให้วงแหวนทุกชั้นแสดงตัวอักษรเป้าหมายเดียวกันที่จุดล็อก (ตำแหน่ง 12 นาฬิกา)

### 🧠 ภารกิจของคุณ:

หาจำนวน "คลิก" น้อยที่สุด ที่จะทำให้วงแหวนทุกชั้นแสดง อักขระเป้าหมาย ตรงกัน ณ จุดล็อก
หากเป็นไปไม่ได้ที่จะหมุนไปให้ตรงกันเลย จงแสดง No Solution

### รูปแบบข้อมูลนำเข้า (Input):
บรรทัดที่ 1:
N T

N = จำนวนชั้นของวงล้อไดโนวีล (3 ≤ N ≤ 9)

T = สัญลักษณ์เป้าหมาย (เป็น ตัวเลขโดด 0–9 เช่น 7, 3 ฯลฯ)

### บรรทัดที่ 2 ถึง N+1 (รวม N บรรทัด):

แต่ละบรรทัดคือสายอักขระของวงล้อแต่ละชั้น ตั้งแต่วงล้อ ชั้นนอกสุด → ชั้นในสุด
แต่ละสายอักขระเป็นตัวเลขโดด (0–9) ที่เรียงตามเข็มนาฬิกา เริ่มจากตำแหน่ง 12 นาฬิกา
ความยาวสายอักขระ (ℓᵢ) อยู่ในช่วง 3 ถึง 100

### รูปแบบข้อมูลส่งออก (Output):

แสดงจำนวน "คลิก" น้อยที่สุด ที่ทำให้ทุกชั้นมีตัวเลข T อยู่ตรงตำแหน่ง 12 นาฬิกา
ถ้า ไม่มีทางหมุนให้สำเร็จเลย, ให้แสดง No Solution

`hint : test case is not worst case eW91IGNhbiBicnV0ZSBmb3JjZQ== `

## Solution

```c
// Your code here
```