# เครื่องวัดพลังจิต

## เครื่องวัดพลังจิต
___

![logo](https://i.ytimg.com/vi/Tbd4vtS9qeA/maxresdefault.jpg?sqp=-oaymwEmCIAKENAF8quKqQMa8AEB-AH-CYAC0AWKAgwIABABGGUgTyhJMA8=&rs=AOn4CLCNaipskLuGSIj8PKdC2cZ2nU2dgg)

เมื่อสัปดาห์ก่อนพี่ถูกเอเลี่ยนบุกมาจับตัวที่บ้านเพื่อเอาตัวพี่ไปทดลอง โดยการทดลองของพวกมันคือการจับพี่ไปเพื่อทำให้พี่สามารถใช้พลังจิตได้ โดยที่พวกมันอยากจะตรวจสอบพลังจิตโดยการวัดค่าพลังจิตจะไช้ค่าสองค่าคือค่า a กับ b โดยค่า a คือค่าความมืด เเละ ค่า b คือค่าความเบียว โดยมีเงื่อนไขพิเศษในการคำนวณดังนี้

1. ถ้า a = 0 เเละ b = 0 ค่าพลังจิตที่วัดได้จะได้ 0 
2. ถ้า a = b ค่าพลังจิตจะเท่ากับ a x b + 42 
3. ถ้า a>b ค่าพลังจิตจะเท่ากับ a - b +99 
4. ถ้านอกเหนือจากเงื่อนไขพิเศษจะมีการคำนวณโดย a + b x 2 - 7 

ที่พี่บอกเงื่อนไขในการคำนวณก็เพราะพี่เผลอทำเครื่องวัดตกเเล้วตอนเเรกมันจะปล่อยพี่กลับเเล้วเเหละ เเต่พี่เผลอทำเครื่องวัดพังมันเลยจับตัวพี่ไว้เป็นตัวประกัน เเฮะๆๆ น้องช่วยพี่ซ่อมเครื่องวัดหน่อย ไม่งั้นพี่ไม่ได้กลับบ้านเเน่เลย ช่วยพี่หน่อยนะน้องๆ
(ค่า a b สามารถเป็นอะไรก็ได้ เเม้เเต่ตัวอักษร)

## Solution

```c
// Your code here
```