# ให้อาหารโปเกมอนเกือบปรากฎในโจทย์การเเข่งขันระดับโลก

พี่ไปเจอโจทย์จาก IMO Shortlist 2023 มาเเหละ พี่เเก้โจทย์นิดหน่อยเท่านั้นนะ เเต่น้องลองดูคำถามที่เกือบได้เป็นคำถามจริงของ IMO 2023 ดูสิ ไม่ใช่เพราะว่าโจทย์ไม่ซีเรียสเกินนะ เพราะมันง่ายเกินไป เเละเพราะมันง่ายนี่เเหละ ห้ามใช้ if กับ math.h ไปซะ

ศาสตราจารย์โอ๊คกำลังป้อนอาหารโปเกมอน K ตัวของเขา โปเกมอนแต่ละตัวมีชามที่มีความจุเป็นจำนวนจริงบวกเป็นกิโลกรัม ความจุเหล่านี้มีเเค่ศาสตราจารย์โอ๊คที่เป็นคนที่รู้ ความจุ C รวมของชามทั้งหมดคือ K กิโลกรัม ศาสตราจารย์โอ๊คแจกจ่ายอาหาร K กิโลกรัมในลักษณะที่โปเกมอนแต่ละตัวได้รับอาหารเป็นจำนวนเต็มไม่ติดลบเป็นกิโลกรัม (ซึ่งอาจมากกว่าความจุของเเต่ละชาม) ระดับความไม่พอใจของโปเกมอนที่ได้รับอาหาร N กิโลกรัมและชามมีความจุ C กิโลกรัมมีค่าเท่ากับ |N - C|

ศาสตราจารย์โอ๊คสามารถแจกจ่ายอาหารในลักษณะที่ผลรวมของระดับความไม่พอใจของโปเกมอนทั้งหมด K ตัวมีค่า D 

หาค่า D ที่น้อยที่สุดที่เป็นไปได้เเละวิธีเเจกจ่ายอาหารโปเกมอนทั้ง K ตัว

---ถ้าเจอเหตุการณ์ที่ต้องเเบ่งอาหารให้ชามที่มีเลขหลังจุดทศนิยมเท่ากัน ให้ชามที่มี index น้อยกว่าก่อน---

input:

บรรทัดเเรก จำนวนเต็มบวก K <= 100

บรรทัดสอง จำนวนจริงบวก C ทั้งหมด K ตัว ที่ผลรวมเท่ากับ K

output:

บรรทัดเเรก จำนวนเต็มที่ไม่ติดลบ(ใช่เเล้ว 0 ได้) N ทั้งหมด K ตัว ที่ผลรวมเท่ากับ K เเละทำให้ D มีค่าน้อยที่สุด ที่ตามด้วย{ค่าความไม่พอใจของเเต่ละ N (ทศนิยม 3 ตำเเหน่ง)} 
**เตือนว่าตัวท้ายสุดไม่ได้ตามหลังด้วย " "**

บรรทัดสอง จำนวนจริง D ที่มีค่าน้อยที่สุด (ทศนิยม 3 ตำเเหน่ง)

## Solution

```c
// Your code here
```