# Balanced Castle Wall

พี่ต้องการเช็คว่ากำแพงปราสาทแห่งหนึ่ง มีกำแพงติดครบทุกฝั่งหรือไม่

## 🎯 เป้าหมาย
จึงให้เขียนโปรแกรมที่รับ `str` โดยให้ทำการเช็คว่าวงเล็บเปิดนั้น มีคู่ปิดของมันหรือเปล่า
โดยคู่วงเล็บที่เช็คมี `(` คู่กับ `)`, `[` คู่กับ `]`, `{` คู่กับ `}` ไม่ต้องสนใจตัวอักษรที่อยู่นอกเหนือวงเล็บ

- ถ้าวงเล็บภายใน `str` จับคู่กันได้อย่างถูกต้องและครบ ให้แสดง `Balanced`
- ถ้าวงเล็บภายใน `str` จับคู่กันผิดหรือไม่ครบ ให้แสดง `Unbalanced`
- กรณีไม่มีวงเล็บเลยให้ถือว่าเป็น `Balanced`

เช่น
- `{abc(def[ghi])}` มีวงเล็บที่จับคู่ครบ จึงเป็น `Balanced` แต่
- `{{abc]}}[` มีวงเล็บที่จับคู่ผิด จึงเป็น `Unbalanced`

## 🗨️ คำอธิบาย Input-Output
| คำอธิบาย | Input |
| ------------- | ------------- |
| โปรแกรมจะรับ Input เป็น `str` 1 คำ | `{abc(def[ghi])}` |

Output ออกมาเป็นคำว่า `Balanced` หรือ `Unbalanced`

## Solution

```c
// Your code here
```