# Pig Latin

พี่ต้องการส่งจดหมาย แต่ไม่ต้องการให้คนอื่นที่ไม่เกี่ยวข้องมาอ่านได้ โดยพี่จะเขียนแบบ Pig Latin

## 🐷 Pig Latin คือ?
Pig Latin เป็นภาษาลับ ที่มีกฎดังต่อไปนี้
- ถ้าคำนั้นขึ้นต้นด้วยพยัญชนะ ให้ย้ายตัวพยัญชนะตัวหน้าไปใว้ข้างหลังสุด แล้วต่อท้ายด้วย ay
เช่น
`hello -> elloh -> ellohay`

- แต่ถ้าเริ่มด้วยสระ (a, e, i, o, u) ให้ต่อท้ายด้วย way เช่น
`orange -> orangeway`

## 🎯 เป้าหมาย
เขียนโปรแกรมที่แปลงคำศัพท์ให้อยู่ในภาษาลับ Pig Latin

## 🗨️ คำอธิบาย Input-Output
โปรแกรมจะรับ Input `str` 1 คำที่เป็น**พิมพ์เล็กเท่านั้น** เช่น
`hello`

และให้แสดงผลในรูปแบบ
`Pig Latin: <pig_latin>`
เช่น `(Pig Latin: ellohay)`

หาก Input อยู่ในรูปแบบที่ไม่ถูกต้องให้แสดง `Invalid`

### รูปภาพประกอบ
![Pig Latin](https://external-content.duckduckgo.com/iu/?u=http%3A%2F%2Fdrive.google.com/uc?id=1iQ0p1M51Q2O80Rdns693P1MOzc7AvbbS)

## Solution

```c
// Your code here
```