// ตรวจสอบรูปแบบของตัวอักษรในคำ
// เขียนโปรแกรมเพื่อตรวจสอบว่า คำที่ป้อนเข้ามา ประกอบด้วย

// ตัวพิมพ์ใหญ่ทั้งหมด (A-Z)
// ตัวพิมพ์เล็กทั้งหมด (a-z)
// หรือเป็นการผสมระหว่างทั้งสองชนิด

// นอกจากนี้ หากมีตัวอักษรที่ไม่ใช่ตัวพิมพ์เล็กหรือตัวพิมพ์ใหญ่ โปรแกรมจะต้องแสดงข้อความว่า "Error"

// หากสตริงมีแต่ตัวพิมพ์ใหญ่ทั้งหมด: แสดง All Capital Letter
// หากสตริงมีแต่ตัวพิมพ์เล็กทั้งหมด: แสดง All Small Letter
// หากมีทั้งพิมพ์ใหญ่และพิมพ์เล็ก: แสดง Mix
// หากมีตัวอักษรอื่นที่ไม่ใช่ตัวอักษรภาษาอังกฤษ: แสดง Error

// หมายเหตุ : ใช้ได้แค่ <stdio.h> เท่านั้น

#include <stdio.h>

int main()
{
    char str[100];
    scanf("%s", str);
    int x = 0, y = 0;

    for (int i = 0; str[i] != '\0'; i++)
    {

        if (str[i] >= 'A' && str[i] <= 'Z')
        {
            x++;
        }
        else if (str[i] >= 'a' && str[i] <= 'z')
        {
            y++;
        }
        else
        {
            printf("Error\n");
            return 0;
        }
    }
    if (x > 0 && y > 0)
    {
        printf("Mix");
    }
    else if (x > 0)
    {
        printf("All Capital Letter");
    }
    else if (y > 0)
    {
        printf("All Small Letter");
    }

    return 0;
}