# เวลานี้ของที่นั้นคือกี่โมงของที่นี่

พี่อยากดูไลฟ์สดของชาวต่างชาติ เเต่ตารางเวลาที่เขาให้ดันอยู่ใน timezone ของเขา เเละคงไม่ใช่เเค่พี่คนเดียวหรอกที่อยากดู เพราะงั้นเเล้วช่วยพี่เเละคนอื่นๆเเปลงเวลาของ timezone เขามาเป็น timezone อื่นหน่อยนะ
ตัวอย่าง ที่ UTC+07:00 จะเร็วกว่าที่ UTC-06:00 อยู่ 7-(-6) = 14 ชั่วโมง ถ้าที่ UTC-06:00 เป็นเวลา 20:00 ที่ UTC+07:00 จะเป็นเวลา 10:00 วันถัดไป
**เดือนเป็นตัวอักษรอังกฤษ 3 ตัวเเรกของชื่อเดือนโดยที่ตัวเเรกเป็นตัวพิมพ์ใหญ่, ปีใช้เป็น ค.ศ, วันตามปฏิทินจริง เเละไม่คิด daylight saving time**

input: 

บรรทัดเเรก รูปเเบบ dd/mmm/yyyy-hh:mm UTC(+,-)hh:mm 

บรรทัดสอง รูปเเบบ UTC(+,-)hh:mm ของโซนที่ต้องเเปลงเป็น

output: 

รูปเเบบ dd/mmm/yyyy-hh:mm ที่เเปลงมาเเล้ว

*สาระน่ารู้ที่อาจจะมีคำใบ้: โลกเเบ่งเป็น timezone ต่างๆ โดยขึ้นอยู่กับภูมิศาสตร์เเละการเมืองการปกครองของเเต่ละประเทศซึ่งเป็นเหตุผลที่ทำให้มีมากกว่า 24 timezone เเละมีรูปร่างที่เเปลกๆ บาง timezone เลยห่างกันเเค่ 15 นาที เเละบาง timezone ก็ห่างกันถึง 1 วัน 2 ชั่งโมง*

## Solution

```c
// Your code here
```