# Merry Christmas

## Merry Christmas
___

![logo](https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQAqMiGjxYBjHEkGp_VGChuZ1tre4MUqPOP7A&s)

>โอ๊ยยยยย ใกล้คริสต์มาสแล้วน้องเอ้ย (เหตุการณ์สมมติ)

พี่อยากได้ต้นคริสต์มาสโชว์ไว้หน้าบ้าน อย่าคิดว่าแค่วาดต้นไม้ใช้ `printf("ต้นคริสต์มาส");` แล้วจบ พี่ไม่เอาง่าย ๆ แบบนั้น!

ภารกิจของน้องคือ:
1. รับค่า weight กับ layer มา
2. weight: ความกว้างฐานของต้นไม้ชั้นบนสุด  
layer: จำนวนชั้นของต้นไม้ (ต้นไม้จริงมีหลายพุ่ม ต้นนี้ก็เช่นกัน)
3. จากนั้นน้องต้องวาด "ต้นคริสต์มาส" ที่มีหลายชั้นลงบนหน้าจอ โดยให้ทุกชั้นมันเรียงซ้อนกันลงมาอย่างงดงาม (เอาง่าย ๆ คือวาดสามเหลี่ยมหลาย ๆ อัน ต่อกันจากบนลงล่าง)

ปล1. พี่อยากเห็นตัว x เรียงกันสวย ๆ ให้เป็นต้นไม้ อย่าให้เบี้ยว อย่าให้ล้น อย่าให้มันแปลกตาน้า  
ปล2. ชั้นแรกของต้นไม้ให้วาดรูปสามเหลื่ยม แต่ความสูงของต้นไม้ในชั้นถัดๆไปสูงแค่ครึ่งหนึ่งของต้นไม้ในชั้นแรก (ปัดขึ้นนะ) 

## Solution

```c
// Your code here
```