# 7Segment | จอ 7 ขีด 1 จุด (0 - 9)

## 7Segment | จอ 7 ขีด 1 จุด (0 - 9)

> ### คำนำ
7 Segment คือหน้าจอแสดงผลตัวเลข - ตัวอักษร ที่มีหน้าจอทำมาจากการจัดวางหลอด LED ในแนวยาว เมื่อทำให้หลอด LED แต่ละดวงติดพร้อมกัน ก็จะทำให้แสดงออกมาเป็นตัวเลขทรงเหลี่ยมได้

![จอ 7Segment](https://cz.lnwfile.com/_/cz/_raw/vs/ne/1w.png)
---
- ขอขอบคุณข้อมูลจาก [Artronshop](https://www.artronshop.co.th/article/30/%E0%B8%81%E0%B8%B2%E0%B8%A3%E0%B9%83%E0%B8%8A%E0%B9%89%E0%B8%87%E0%B8%B2%E0%B8%99-7-segment-%E0%B8%81%E0%B8%B1%E0%B8%9A-arduino-%E0%B8%95%E0%B8%AD%E0%B8%99%E0%B8%97%E0%B8%B5%E0%B9%88-1-7-segment-%E0%B8%AB%E0%B8%A5%E0%B8%B1%E0%B8%81%E0%B9%80%E0%B8%94%E0%B8%B5%E0%B8%A2%E0%B8%A7)
---

> ### โจทย์
อยากให้น้องเขียนโปรแกรมแสดงตัวเลข 0 - 9 ในรูปแบบของจอแสดงผลแบบ 7Segment โดยให้รับ input มา 1 ตัว แล้วให้ output เป็นตัวเลขดังกล่าวในรูปแบบของจอ 7Segment

> ### หมายเหตุ
- กำหนดให้น้องใช้ '_' แทนเส้นแนวนอนของจอ 7Segment ที่ติด
- กำหนดให้น้องใช้ '|' แทนเส้นแนวนอนของจอ 7Segment ที่ติด
- กำหนดให้น้องใช้ ' ' แทนเส้นของจอ 7Segment ที่ดับ
- กำหนดให้เมื่อตัวเลขเกิน 9 หรือ ต่ำกว่า 0 ให้แสดง "Error\n"
* **คำใบ้**
    1. คำใบ้ ใน 1 แถวมี 3 ตัวอักษร
    2. คำใบ้ 1 ตัวเลขมี 3 บรรทัด
    3. คำใบ้ไม่ใช้ loop ก็ทำได้

> ### รูปประกอบ
![ตัวเลขบนจอ 7Segment](https://electronics-fun.com/wp-content/uploads/2020/11/Seven-segment-display.png)



## Solution

```c
// Your code here
```