# Brave and Fear

พี่นั้นเป็นคนขี้กลัว กลัวไปหมดทุกอย่างทั้งเงา เสียงฟ้าร้อง คะแนนสอบ เปิดgacha พี่จึงไปขอความกล้าจากรุ่นพี่ปี3 คนนึงบ่อยๆ จนวันนึงรุ่นพี่คนนั้นไม่มีความกล้าให้ พี่จึงต้องไปขอความกลัวเพื่อปรับสมดุลความกล้าของรุ่นพี่คนนั้นแทน พี่จึงอยากให้น้องเขียนโปรแกรมคำนวนความกล้าที่เหลืออยู่ขอรุ่นพี่คนนั้นให้พี่หน่อย โดยถ้าใส่คำว่า Brave ความกล้าของรุ่นพี่คนนั้นจะลด และถ้าใส่ Fear คามกล้าจะเพิ่มโดยผลสุดท้ายจะแสดงผลความกล้าที่เหลืออยู่ แต่ถ้าความกล้าเหลือ 0 แล้วใส่คำว่า Brave จะแสดงผลจะหยุดการขอทันที

# Input
##### บรรทัดที่ 1 ค่า int แสดงจำนวนความกล้าที่มีอยู่
##### บรรทัดที่ 2 ค่า int n จำนวน action ที่จะขอ
##### บรรทัดที่ 3 ถึง n+2 รับค่า string Brave ,Fear

# Output
##### ค่า Brave ที่เหลืออยู่

## Solution

```c
// Your code here
```