# Armstrong Numbers

พี่อยากได้โปรแกรมที่ช่วยคำนวณว่าเลขที่ป้อน เป็น Armstrong Number หรือไม่

## #️⃣ Armstrong Numbers
Armstrong Numbers เป็นจำนวน ที่เท่ากับผลรวมของเลขโดดแต่ละหลัก ยกกำลังด้วยจำนวนหลักของจำนวนนั้น

เช่น

`371 = 3^3 + 7^3 + 1^3 = 27 + 343 + 1 = 371`: 371 จึงเป็น Armstrong Number

`1634 = 1^4 + 6^4 + 3^4 + 4^4 = 1 + 1296 + 81 + 256 = 1634`: 1634 จึงเป็น Armstrong Number

## 🗨️ คำอธิบาย Input-Output
Input เป็น `int` (Testcase จะเช็คแค่กรณี `0 <= n <= 999,999,999`) 
Output เป็น `Armstrong number` หรือ `Not an Armstrong number`

## Solution

```c
// Your code here
```