# ขั้วโลกเหนือหนาวมาก

ณ ขั้วโลกเหนือ พบธารน้ำแข็งมีรูปร่างเป็นตารางขนาด5*5 แต่ละช่องในตารางนี้จะเป็นก้อนน้ำแข็งหรือน้ำทะเล โดยให้เลข 0 แทนน้ำทะเล และเลขจำนวนเต็มบวกแทนความหนาของก้อนน้ำแข็ง(เช่น เลข 2 แทนก้อนน้ำแข็งหนา 2 หน่วย) แต่เนื่องจากภาวะโลกร้อนจึงทำให้ในแต่ละวัน น้ำแข็งจะละลายลงโดยมีเงื่อนไขว่า หากน้ำแข็งข่องใดติดกับน้ำทะเลในทิศ เหนือ ใต้ ตะวันออก ตะวันตก(แนวทะแยงไม่นับ) จะละลายลงเท่ากับจำนวนด้านที่ติดกับน้ำทะเล(เช่น อยู่ติดน้ำทะเล ทิศเหนือกับทิศใต้ ก็จะละลายวันละ 2 หน่วย) และหากก้อนน้ำแข็งละลายไปเรื่อยๆอาจจะทำให้ก้อนน้ำแข็งที่เชื่อมติดกันอยู่ละลายออกจากกัน ทำให้เกิดการแยกตัวของน้ำแข็ง(การเชื่อมติดกันของก้อนน้ำแข็งจะดูแค่ในทิศเหนือ ใต้ ตะวันออก ตะวันตกเท่านั้น) ซึ่งน้องๆเป็นนักวิทยาศาสตร์ที่มาตรวจสอบธารน้ำแข็งนี้และต้องการรู้ว่า ต้องใช้เวลากี่วันก้อนน้ำแข็งถึงจะเกิดการแยกตัว หรือละลายไปจนหมดก่อนจะแยกตัว

(ภาพตัวอย่าง)
![ตัวอย่าง](https://i.ibb.co/MDZWyKRF/Screenshot-2025-05-13-112024.png)


## Solution

```c
// Your code here
```