# พื้นฐานนักสืบ : 001 | การถอดรหัสข้อความ

## พื้นฐานนักสืบ : 001 | การถอดรหัสข้อความ

> ### คำนำ
การถอดรหัสข้อความแทบจะเป็นพื้นฐานของการสืบสวน เนื่องจากการที่เข้ารหัสข้อความทำให้ผู้ส่งและผู้รับเข้าใจข้อความที่ต้องการสื่อได้ง่าย แต่คนภายนอกไม่สามารถอ่านข้อความออกได้หากไม่รู้วิธีถอดรหัส ในข้อนี้ต้องการให้ช่วยเขียนโปรแกรมถอดรหัสแบบพื้นฐาน มาร่วมเป็นนักสืบไขคดีไปด้วยกัน กับชุดโจทย์ พื้นฐานนักสืบ

> ### โจทย์
ณ บ้านพักตากอากาศกลางป่าเขา คุณได้รับการว่าจ้างให้มาไขปริศนาของบ้านพักตากอากาศแห่งหนึ่งโดยผู้ว่าจ้างได้กล่าวกับคุณว่าต้องการให้ช่วยไขปริศนา ห้องลับของบ้านหลังนี้ที่เจ้าของบ้านคนก่อนทิ้งไว้ก่อนจะหายไป โดยเจ้าของบ้านคนก่อนได้ทิ้งรหัสไว้จำนวนมากหนึ่งในนั้นมีข้อความที่ถอดรหัสได้ดังนี้ `See_Mirror_In_Baht_Room` ซึ่งมาจากชุดข้อความ `Nzz_Hdmmjm_Di_Wvco_Mjjh|5` 
ด้วยความที่มีรหัสจำนวนมากเลยอยากให้คุณช่วยเขียนโปรแกรมแปลงรหัสจากตัวอย่าง Output และ Input ดังกล่าว เพื่อให้สะดวกแก่การค้นหาห้องลับภายในบ้านหลังนี้

> ### หมายเหตุ
1. การถอดรหัสนี้ใช้หลักการของ Caesar Cipher โดยการเลื่อนตัวอักษร
2. ชุดข้อความ Input 
    1. `text|number` ใช้ตัว `"|"` กั้นระหว่างข้อความ และตัวช่วยถอดรหัส
3. การถอดรหัส
    1. การเลื่อนอักษรหากเกินให้วนกลับไปที่ตัวแรก
    2. เลื่อนเฉพาะตัว a-z และ A-Z เท่านั้น
    3. ตัวเลขด้านหลังเป็นบวกเสมอ

![รูปประกอบ](https://i.ibb.co/kgnMHnjN/Timmerman-Industries.png)

## Solution

```c
// Your code here
```