# ปริศนาแห่งนครเร้นลับ2

## ปริศนาแห่งนครเร้นลับ2
___

![logo](https://sdmntprwestus3.oaiusercontent.com/files/00000000-1804-61fd-b700-27d92bc192c8/raw?se=2025-06-07T15%3A45%3A52Z&sp=r&sv=2024-08-04&sr=b&scid=5e626a73-c126-54ac-9ef7-d6bcbfd2bb04&skoid=04233560-0ad7-493e-8bf0-1347c317d021&sktid=a48cca56-e6da-484e-a814-9c849652bcb3&skt=2025-06-07T01%3A13%3A29Z&ske=2025-06-08T01%3A13%3A29Z&sks=b&skv=2024-08-04&sig=KsakxIyt/DeDgiW3qtDeYv7TOBulIZnW7ZMTft2pFbA%3D)

จากการผจญภัยในนครเร้นลับที่ผ่านมาน้องได้เปิดประตูห้องแห่งขุมทรัพย์ด้วยการเรียงลำดับตัวเลขแห่งปัญญาสำเร็จแล้ว ซึ่งน้องได้รับสมบัติไปจำนวนมาก ต่อมาพี่พบว่ามีหีบลับอยู่ใจกลางห้องซึ่งคาดว่าภายในมีขุมทรัพย์ที่มีค่ามหาศาลเป็นจำนวนมาก ซึ่งในการจะเปิดหีบสมบัติได้น้องเป็นเป็นผู้ถูกเลือกจากมหาเทพผู้คุ้มครองสมบัตินามว่า tralalero tralala โดยมหาเทพต้องการให้น้องหาค่า พื้นที่รูปสามเหลี่ยมบนพิกัดจุด 3 มิติ และพิกัดจุดที่ทำให้พื้นที่บนรูป 3 เหลี่ยมมีค่ามากที่สุด โดยมหาเทพกำหนดจุดบนพิกัด 3 มิติ มาทั้งหมด 8 จุดด้วยกันน้องต้องพยายามหาพิกัดทั้ง 3 จุด และแสดงค่าพื้นที่ออกมา (ค่าพื้นที่แสดงเป็นทศนิยม 2 ตำแหน่ง)

## Solution

```c
// Your code here
```