# พื้นฐานนักสืบ : 002 | หาเบาะแสจากที่เกิดเหตุ

## พื้นฐานนักสืบ : 002 | หาเบาะแสจากที่เกิดเหตุ

> ### คำนำ
การสืบสวนคดีต่างๆ มักเริ่มต้นจากการค้นหาเบาะแสที่เกิดขึ้นในที่เกิดเหตุ (Crime Scene) ซึ่งเป็นพื้นที่ที่เกิดเหตุการณ์ผิดปกติหรืออาชญากรรม เบาะแสเหล่านี้มีความสำคัญอย่างยิ่งในการแก้ไขคดี เพราะมันช่วยให้ตำรวจหรือทีมสืบสวนสามารถสร้างภาพรวมของเหตุการณ์ที่เกิดขึ้นได้ แม้ว่าผู้ต้องสงสัยจะพยายามทำลายหรือปกปิดหลักฐานก็ตาม

> ### โจทย์
จากการไขรหัสในตอนที่แล้วทำให้เราได้ไปเจอกับห้องหนึ่ง พร้อมกับตู้เซฟ ภายในห้องนั้น พร้อมคำใบ้สุดท้ายจากรหัสก่อนหน้าที่บอกว่า "ทุกอย่างนั้นอยู่ในห้องนี้" โดยในห้องนี้มีของหลายอย่างที่มีเลขกำกับ ทำให้เราเชื่อกันว่า สิ่งนั้นน่าจะเป็นคำใบ้ในการถอดรหัส พร้อมกับกระดาษอักษรเที่ยบกับตัวเลข เช่น `"B" = 8, 'I' = 1` เป็นต้น จากการช่วยกันคิดทำให้เรารู้ว่าชื่อสิ่งของในภาษาอังกฤษนั้นสามารถแปลงเป็นรหัสได้ เช่น `Cabinet > 1 4 8 1 3 7 > Y` แต่ด้วยความที่ของมีจำนวนมากเลขอยากให้ช่วยเขียนโค้ดเพื่อหา รหัสเปิดเซฟหน่อย

> ### หลักการแก้รหัส
1. แยกตัวอักษร
    - คำว่า Base แยกเป็น B A S E
2. เที่ยบตัวอักษรกับตารางรหัส
    - ฺB = 8, A = 4, S = 5, E = 3
3. เอาเลขที่ได้มาบวกกัน
    - 8+4+5+3 = 20
4. เอาเลขที่ได้มาเที่ยบกับลำดับอักษรอังกฤษ
    - 20 = T

![รูปประกอบ](https://i.ibb.co/d4tRFwjn/002.png)

## Solution

```c
// Your code here
```