# LeapYear

พี่อยากให้น้องเขียนโปรแกรมเช็คปีอธิกสุรทินโดยรับ input เป็นจำนวนเต็มปี ค.ศ. แล้วบอกว่าเป็นปีอธิกสุรทินหรือไม่
ปีอธิกสุรทิน (ภาษาอังกฤษ : Leap Year) เป็นชื่อเรียกของปีที่เดือนกุมภาพันธ์มี 29 วัน

สามารถคำนวณจากสูตรไว้ดังนี้

-ปีที่ถือเป็นปีอธิกสุรทิน คือ ปีที่เดือนกุมภาพันธ์มี 29 วัน และสามารถนำปี ค.ศ. หารด้วย 4 ลงตัว 

-หากปีนั้นหารด้วย 100 ลงตัว จะยังคงให้เป็นปีปกติ แต่ถ้าปีนั้นหารด้วย 400 ลงตัว ให้ปรับไปเป็นปีอธิกสุรทิน

(ขอบคุณข้อมูลจาก www.thairath.co.th)

ปล.ปีเริ่มนับที่ ค.ศ. 1 เด้อ

## Solution

```c
// Your code here
```